jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
/*
File:   MQTT.cpp
Author: J. Ian Lindsay
Date:   2025.12.27

This file contains a reusable wrapper for the ESP32's MQTT features.

Refactor notes:
  - MQTT does NOT register for IP stack events.
  - Network readiness is queried from ESP32Radio via injected pointer.
  - MQTT connection truth is mailbox-driven from ESP-MQTT event handler.
*/

#include "../ESP32.h"

#if defined(__BUILD_HAS_CBOR)
  #include "cbor-cpp/cbor.h"
#endif

#if !defined(CONFIG_MQTT_PROTOCOL_5)
  #error "This driver requires CONFIG_MQTT_PROTOCOL_5. Enable it in menuconfig (Component config → MQTT → MQTT Protocol v5)."
#endif

// TODO: Test for MQTT_TRANSPORT_SSL MQTT_TRANSPORT_WS and sec variants, and
//   build support accordingly. This is mostly to save weight in the binary,
//   but will also prevent surprises at runtime attributable to missing support.

/*******************************************************************************
*      _______.___________.    ___   .___________. __    ______     _______.
*     /       |           |   /   \  |           ||  |  /      |   /       |
*    |   (----`---|  |----`  /  ^  \ `---|  |----`|  | |  ,----'  |   (----`
*     \   \       |  |      /  /_\  \    |  |     |  | |  |        \   \
* .----)   |      |  |     /  _____  \   |  |     |  | |  `----.----)   |
* |_______/       |__|    /__/     \__\  |__|     |__|  \______|_______/
*
* Static members and initializers should be located here.
*******************************************************************************/
MQTTClient* MQTT_CLIENT_INSTANCE = nullptr;


const EnumDef<MQTTCliState> _STATE_LIST[] = {
  { MQTTCliState::UNINIT,        "UNINIT"},
  { MQTTCliState::INIT,          "INIT"},
  { MQTTCliState::CONNECTING,    "CONNECTING"},
  { MQTTCliState::CONNECTED,     "CONNECTED"},
  { MQTTCliState::DISCONNECTING, "DISCONNECTING"},
  { MQTTCliState::DISCONNECTED,  "DISCONNECTED"},
  { MQTTCliState::FAULT,         "FAULT"},
  { MQTTCliState::INVALID,       "INVALID", (ENUM_WRAPPER_FLAG_CATCHALL)}  // FSM hygiene.
};
const EnumDefList<MQTTCliState> _FSM_STATES(&_STATE_LIST[0], (sizeof(_STATE_LIST) / sizeof(_STATE_LIST[0])), "MQTTCliState");



/*******************************************************************************
* ESP-MQTT event handler
* NOTE: This is running inside ESP-IDF's event loop task. It must not call into
*   FSM route APIs. It *may* set mailboxes.
*******************************************************************************/
void mqtt_event_handler(void* handler_args, esp_event_base_t base, int32_t event_id, void* event_data) {
  static const char* const TAG = "mqtt_event_handler";
  ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%" PRIi32 "", base, event_id);

  esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t) event_data;
  esp_mqtt_client_handle_t client = event->client;
  MQTTClient* self = (MQTTClient*) handler_args;

  int msg_id;

  switch ((esp_mqtt_event_id_t) event_id) {
    case MQTT_EVENT_CONNECTED:
      ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(true);
        self->_mb_set_mqtt_disconnected(false);
      }
      // Demo traffic as before.
      msg_id = esp_mqtt_client_publish(client, "/topic/qos1", "data_3", 0, 1, 0);
      ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
      msg_id = esp_mqtt_client_subscribe(client, "/topic/qos0", 0);
      ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
      msg_id = esp_mqtt_client_subscribe(client, "/topic/qos1", 1);
      ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
      msg_id = esp_mqtt_client_unsubscribe(client, "/topic/qos1");
      ESP_LOGI(TAG, "sent unsubscribe successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_DISCONNECTED:
      ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(false);
        self->_mb_set_mqtt_disconnected(true);
      }
      break;

    case MQTT_EVENT_SUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
      msg_id = esp_mqtt_client_publish(client, "/topic/qos0", "data", 0, 0, 0);
      ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_UNSUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_PUBLISHED:
      ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_DATA:
      ESP_LOGI(TAG, "MQTT_EVENT_DATA");
      printf("TOPIC=%.*s\r\n", event->topic_len, event->topic);
      printf("DATA=%.*s\r\n", event->data_len, event->data);
      break;

    case MQTT_EVENT_ERROR:
      ESP_LOGI(TAG, "MQTT_EVENT_ERROR");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(false);
        self->_mb_set_mqtt_disconnected(true);
      }
      if (event->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
        ESP_LOGW(TAG, "Last errno string (%s)", strerror(event->error_handle->esp_transport_sock_errno));
      }
      break;

    case MQTT_EVENT_BEFORE_CONNECT:   // Unhandled. No special actions required.
      break;

    default:
      ESP_LOGI(TAG, "Other event id:%d", event->event_id);
      break;
  }
}



/*******************************************************************************
* MQTTBrokerDef
*******************************************************************************/

MQTTBrokerDef::MQTTBrokerDef(const char* LABEL) {
  label(LABEL);
  memset(_uri,   0, sizeof(_uri));
  memset(_usr,   0, sizeof(_usr));
  memset(_pass,  0, sizeof(_pass));
  _autoconnect = true;
  _cli_conf = {
    .broker = {
      .address = {
        .uri = _uri,
      }
    },
    .credentials = {
      .username = _usr,
      .authentication = {
        .password = _pass,
      }
    },
    .session = {
      .last_will = {
        .topic = "/topic/will",
        .msg = "i will leave",
        .msg_len = 12,
        .qos = 1,
        .retain = true,
      },
      .protocol_ver = MQTT_PROTOCOL_V_5,
    },
    .network = {
      .disable_auto_reconnect = true,
    },
  };
}


