jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
bool MQTTBrokerDef::isValid() {
  const char* LABEL = label();   // These can never be nullptr. Only zero length.
  const char* URI   = uri();     // These can never be nullptr. Only zero length.
  if ((0 == strlen(LABEL)) || (0 == strlen(URI))) {  return false;  }

  // "Sensible URI": require mqtt:// or mqtts:// prefix.
  if (0 == strncmp(URI, "mqtt://", 7))  return true;
  if (0 == strncmp(URI, "mqtts://", 8)) return true;
  if (0 == strncmp(URI, "ws://", 5))  return true;
  if (0 == strncmp(URI, "wss://", 6)) return true;

  return false;
}

void MQTTBrokerDef::label(const char* LABEL) {
  const uint32_t FIELD_SIZE = sizeof(_label);
  memset(_label, 0, FIELD_SIZE);
  if (nullptr != LABEL) {
    memcpy(_label, LABEL, strict_min((uint32_t) strlen(LABEL), FIELD_SIZE-1));
  }
}


void MQTTBrokerDef::uri(const char* URI) {
  const uint32_t FIELD_SIZE = sizeof(_uri);
  memset(_uri, 0, FIELD_SIZE);
  if (nullptr != URI) {
    memcpy(_uri, URI, strict_min((uint32_t) strlen(URI), FIELD_SIZE-1));
  }
}


void MQTTBrokerDef::user(const char* USER) {
  const uint32_t FIELD_SIZE = sizeof(_usr);
  memset(_usr, 0, FIELD_SIZE);
  if (nullptr != USER) {
    memcpy(_usr, USER, strict_min((uint32_t) strlen(USER), FIELD_SIZE-1));
  }
}


void MQTTBrokerDef::passwd(const char* PASSWD) {
  const uint32_t FIELD_SIZE = sizeof(_pass);
  memset(_pass, 0, FIELD_SIZE);
  if (nullptr != PASSWD) {
    memcpy(_pass, PASSWD, strict_min((uint32_t) strlen(PASSWD), FIELD_SIZE-1));
  }
}

uint32_t MQTTBrokerDef::topicCount() {  return _subs.count();  }
int MQTTBrokerDef::clearTopics() {      _subs.clear();   return 0;   }


char* MQTTBrokerDef::topic(const int IDX) {
  if (_subs.count() > IDX) {
    return _subs.position_trimmed(IDX);
  }
  return nullptr;
}


/**
* Sanitizes and adds a topic string to the broker.
* - rejects nullptr, empty, or pure whitespace after trim
* - de-dupes against existing topics
* Returns >=0 on success: the index of the topic in the list.
*/
int MQTTBrokerDef::addTopic(const char* TOPIC_IN) {
  int ret = -1;
  if (nullptr != TOPIC_IN) {
    ret--;
    StringBuilder tmp(TOPIC_IN);
    tmp.trim();  // kill leading/trailing whitespace
    if (0 < tmp.length()) {
      ret--;
      const int EXISTING_COUNT = _subs.count();
      for (int i = 0; i < EXISTING_COUNT; i++) {
        char* t = _subs.position_trimmed(i);
        if (nullptr != t) {
          // MQTT topics are case-sensitive, so strcmp is correct.
          if (0 == strcmp(t, (const char*) tmp.string())) {
            return i;  // Already present: treat as success with no mutation.
          }
        }
      }
      // If we didn't bail, we didn't have the topic in the list. Add it.
      _subs.concat((const char*) tmp.string());
      ret = EXISTING_COUNT;
    }
  }
  return ret;
}




int MQTTBrokerDef::serialize(StringBuilder* out, const TCode FORMAT) {
  int ret = -1;
  if (!isValid()) {  return ret;  }

  switch (FORMAT) {
    case TCode::STR:
      printDebug(out);
      ret = 0;
      break;

    case TCode::BINARY:  // Unimplemented. Do not implement.
      break;

    #if defined(__BUILD_HAS_CBOR)
    case TCode::CBOR:
      {
        cbor::output_stringbuilder output(out);
        cbor::encoder encoder(output);

        const uint8_t KEY_COUNT = (topicCount() > 0) ? 6:5;   // Five baselines values to be encoded.

        // Encode this into IANA space as a vendor code.
        encoder.write_tag(C3P_CBOR_VENDOR_CODE | TcodeToInt(FORMAT));

        // {"MQTTBrokerDef": {"label":..,"uri":..,"user":..,"passwd":..,"autoconnect":..,"topics":[..]}}
        encoder.write_map(1);
        encoder.write_string("MQTTBrokerDef"); encoder.write_map(KEY_COUNT);
          encoder.write_string("label");       encoder.write_string(label());
          encoder.write_string("uri");         encoder.write_string(uri());
          encoder.write_string("user");        encoder.write_string(user());
          encoder.write_string("passwd");      encoder.write_string(passwd());
          encoder.write_string("autoconnect"); encoder.write_bool(autoconnect());
          if (topicCount() > 0) {
            encoder.write_string("topics");
            const int TCOUNT = _subs.count();
            encoder.write_array(TCOUNT);
            for (uint32_t t_id = 0; t_id < TCOUNT; t_id++) {
              char* t = _subs.position_trimmed(t_id);
              encoder.write_string((nullptr == t) ? "" : t);
            }
          }
        ret = 0;
      }
      break;
    #endif  // __BUILD_HAS_CBOR

    default:
      break;
  }
  return ret;
}


void MQTTBrokerDef::printDebug(StringBuilder* output) {
  if (isValid()) {
    const char* USER   = user();
    const char* PASSWD = passwd();
    const char* safe_u_str = ((0 == strlen(USER)) ? "[UNSET]" : USER);
    const char* safe_p_str = ((0 == strlen(PASSWD)) ? "[UNSET]" : PASSWD);
    output->concatf("\t[%s]\t%s:%s@%s\n", label(), safe_u_str, safe_p_str, uri());
  }
  else {
    output->concat("Broker is invalid.\n");
  }
}



void MQTTBrokerDef::printTopicList(StringBuilder* output) {
  const int TCOUNT = _subs.count();
  if (TCOUNT > 0) {
    StringBuilder tmp("\tTopics:\n");
    for (int i = 0; i < TCOUNT; i++) {
      char* t = _subs.position_trimmed(i);
      if ((nullptr != t) && (0 < strlen(t))) {
        tmp.concatf("\t\t[%d] %s\n", i, t);
      }
    }
    tmp.string();
    output->concatHandoff(&tmp);
  }
}



/*******************************************************************************
* MQTTClient
*******************************************************************************/

/*
* Constructor
*/
MQTTClient::MQTTClient() :
  StateMachine<MQTTCliState>("MQTTClient-FSM", &_FSM_STATES, MQTTCliState::UNINIT, 8)
{
  MQTT_CLIENT_INSTANCE = this;
  _radio = nullptr;
  _client_handle = nullptr;

  // Policy defaults.
  _flags.set(MQTT_FLAG_AUTOCONNECT, true);
  _flags.set(MQTT_FLAG_SUBS_COMPLETE, false);

  // Backoff defaults.
  _reconnect_backoff_ms     = 5000;
  _reconnect_backoff_ms_max = 60000;

  _connect_attempt_active     = false;
  _mqtt_connected_latched     = false;
  _mqtt_disconnected_latched  = false;

  _sub_cursor         = 0;
  _sub_pending_msg_id = -1;
  _mb_suback_msg_id   = -1;
}


