jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
/*
* Destructor
*/
MQTTClient::~MQTTClient() {}


int8_t MQTTClient::init() {
  int8_t ret = 0;
  // Do not imply "connect now". We idle in DISCONNECTED and let policy drive.
  _fsm_set_route(2, MQTTCliState::INIT, MQTTCliState::DISCONNECTED);
  return ret;
}


/*******************************************************************************
* Mailbox helpers (event-loop context)
*******************************************************************************/
void MQTTClient::_mb_set_mqtt_connected(const bool v) { _mb_mqtt_connected = v; }
void MQTTClient::_mb_set_mqtt_disconnected(const bool v) { _mb_mqtt_disconnected = v; }


/**
* Called when any broker property changes.
* Clears init flags and plans a regression to INIT (disconnecting first if needed).
*/
void MQTTClient::_broker_changed_reinit_plan() {
  // Clear things that are specific to the current client handle.
  _flags.clear(MQTT_FLAG_ESP_MQTT_INIT | MQTT_FLAG_EVENT_REGISTERED);

  // Any in-flight attempt should be considered invalid now.
  _connect_attempt_active = false;
  _mqtt_connected_latched = false;
  _mqtt_disconnected_latched = false;

  // Ensure we end up in INIT so that the client handle is rebuilt using new broker config.
  // If currently connected, we must gracefully stop first.
  if (connected()) {
    // Blow out our existing state plan with one that
    _fsm_set_route(4, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED, MQTTCliState::INIT, MQTTCliState::DISCONNECTED);
  }
  else {
    // If we're CONNECTING/DISCONNECTED/INIT, just ensure INIT is next so it rebuilds.
    _fsm_prepend_state(MQTTCliState::INIT);
  }
}



/*******************************************************************************
* MQTT console support
*******************************************************************************/

void MQTTClient::printDebug(StringBuilder* output) {
  StringBuilder tmp;
  StringBuilder prod_str("MQTTClient");
  prod_str.concatf(" [%sinitialized]", (initialized() ? "" : "un"));
  StringBuilder::styleHeader2(&tmp, (const char*) prod_str.string());
  printFSM(&tmp);

  tmp.concatf("\t Client autoconnect: %c\n", (autoconnect() ? 'y' : 'n'));
  tmp.concatf("\t Broker autoconnect: %c\n", (_current_broker.autoconnect() ? 'y' : 'n'));
  tmp.concatf("\t Broker valid:       %c\n", (_current_broker.isValid() ? 'y' : 'n'));
  tmp.concatf("\t Subs complete:      %c\n", (_flags.value(MQTT_FLAG_SUBS_COMPLETE) ? 'y' : 'n'));
  tmp.concatf("\t Subs cursor:        %d\n", _sub_cursor);
  tmp.concatf("\t Backoff:            %u ms (max %u)\n", _reconnect_backoff_ms, _reconnect_backoff_ms_max);

  if (initialized()) {
    if (connected()) {
      tmp.concat("Connected to broker:\n");
      _current_broker.printDebug(&tmp);
    }
    if (nullptr != _radio) {
      tmp.concatf("\t Radio link:    %c\n", (_radio->linkUp() ? 'y' : 'n'));
      tmp.concatf("\t Radio hasIP:   %c\n", (_radio->hasIP() ? 'y' : 'n'));
      if (_radio->hasIP()) {
        const uint32_t ip = _radio->ip4();
        tmp.concatf("\t Radio IPv4:    %u.%u.%u.%u\n",
          (ip & 0xFF), ((ip >> 8) & 0xFF), ((ip >> 16) & 0xFF), ((ip >> 24) & 0xFF));
      }
    }
    else {
      tmp.concat("\t Radio:         [UNBOUND]\n");
    }
  }
  else {
    tmp.concatf("\t ESP_MQTT_INIT:      %c\n", (_flags.value(MQTT_FLAG_ESP_MQTT_INIT) ? 'y' : 'n'));
    tmp.concatf("\t EVENT_REGISTERED:   %c\n", (_flags.value(MQTT_FLAG_EVENT_REGISTERED) ? 'y' : 'n'));
    tmp.concatf("\t EVENT_LOOP_CREATED: %c\n", (_flags.value(MQTT_FLAG_EVENT_LOOP_CREATED) ? 'y' : 'n'));
  }

  tmp.string();
  output->concatHandoff(&tmp);
}



int MQTTClient::console_handler_mqtt_client(StringBuilder* txt_ret, StringBuilder* args) {
  int ret = 0;
  char* cmd = args->position_trimmed(0);

  if (0 == StringBuilder::strcasecmp(cmd, "topic")) {
    bool print_usage = false;
    if (1 < args->count()) {
      char* subcmd = args->position_trimmed(1);
      if (0 == StringBuilder::strcasecmp(subcmd, "add")) {
        if (2 <= args->count()) {
          args->drop_position(0);  // Drop the string "topic".
          args->drop_position(0);  // Drop the string "add".
          while (0 < args->count()) {  // While we have any left over...
            char* t = args->position_trimmed(0);
            int idx = _current_broker.addTopic(t);
            if (idx >= 0) {
              txt_ret->concatf("Topic [%s] added at index %d.\n", t, idx);
            }
            else {
              txt_ret->concatf("Topic [%s] rejected.\n", t);
            }
            args->drop_position(0);  // Drop the just-handled topic argument.
          }
        }
        else {
          txt_ret->concat("Usage: topic add <topic> [topic] [topic] ...\n");
        }
      }
      else if (0 == StringBuilder::strcasecmp(subcmd, "list")) {
        _current_broker.printTopicList(txt_ret);
      }
      else if (0 == StringBuilder::strcasecmp(subcmd, "clear")) {
        _current_broker.clearTopics();
        txt_ret->concat("Topics cleared.\n");
      }
      else {
        print_usage = true;
      }
    }
    else {
      print_usage = true;
    }
    if (print_usage) {  txt_ret->concat("Usage: topic [add|list|clear] ...\n"); }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "broker")) {
    if (5 == args->count()) {
      //m broker home mqtt://192.168.0.3 dgmj-mqtt dgmj-mqtt
      char* lab  = args->position_trimmed(1);
      char* uri  = args->position_trimmed(2);
      char* user = args->position_trimmed(3);
      char* pass = args->position_trimmed(4);

      _current_broker.label(lab);
      _current_broker.uri(uri);
      _current_broker.user(user);
      _current_broker.passwd(pass);

      _broker_changed_reinit_plan();
      txt_ret->concat("Broker updated.\n");
      _current_broker.printDebug(txt_ret);
    }
    else if (1 == args->count()) {
      _current_broker.printDebug(txt_ret);
    }
    else {
      txt_ret->concatf("Usage: %s [<label> <uri> <user> <pass>].\n", cmd);
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "auto")) {
    if (2 == args->count()) {
      autoconnect(0 != args->position_as_int(1));
    }
    txt_ret->concatf("MQTTClient autoconnect: %c\n", (autoconnect() ? 'y' : 'n'));
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "brokerauto")) {
    if (2 == args->count()) {
      _current_broker.autoconnect(0 != args->position_as_int(1));
    }
    txt_ret->concatf("Broker autoconnect: %c\n", (_current_broker.autoconnect() ? 'y' : 'n'));
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "backoff")) {
    txt_ret->concatf("Backoff: %u ms (max %u)\n", _reconnect_backoff_ms, _reconnect_backoff_ms_max);
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "max_backoff")) {
    if (2 == args->count()) {
      uint32_t v = (uint32_t) args->position_as_int(1);
      // Clamp to something sane: at least 1000ms and not 0.
      _reconnect_backoff_ms_max = strict_max(v, (uint32_t) 1000);
      if (_reconnect_backoff_ms > _reconnect_backoff_ms_max) {
        _reconnect_backoff_ms = _reconnect_backoff_ms_max;
      }
    }
    txt_ret->concatf("Max backoff: %u ms\n", _reconnect_backoff_ms_max);
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "con")) {
    // User intent: re-enable greedy connect.
    autoconnect(true);
    if (!connected()) {
      ret = _fsm_append_route(2, MQTTCliState::CONNECTING, MQTTCliState::CONNECTED);
    }
    else {
      txt_ret->concat("MQTTClient is already connected.\n");
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "discon")) {
    // User intent: override greedy connect (stay parked).
    autoconnect(false);
    if (connected()) {
      ret = _fsm_append_route(2, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED);
    }
    else {
      // Ensure we are parked and stable.
      ret = _fsm_prepend_state(MQTTCliState::DISCONNECTED);
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "pack")) {
    StringBuilder cbor_str;
    _current_broker.serialize(&cbor_str, TCode::CBOR);
    cbor_str.printDebug(txt_ret);
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "parse")) {
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "fsm")) {
    args->drop_position(0);
    ret = fsm_console_handler(txt_ret, args);  // Shunt into the FSM console handler.
  }
  else {
    printDebug(txt_ret);
  }

  return ret;
}



/**
*
* @return PollResult
*/
FAST_FUNC PollResult MQTTClient::poll() {
  // Latch mailboxes (event-loop -> poll/FSM context).
  if (_mb_mqtt_connected) {
    _mqtt_connected_latched = true;
    _mqtt_disconnected_latched = false;
    _mb_mqtt_connected = false;
  }
  if (_mb_mqtt_disconnected) {
    _mqtt_connected_latched = false;
    _mqtt_disconnected_latched = true;
    _mb_mqtt_disconnected = false;
  }

