jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
  // SUBACK mailbox handling.
  if (_mb_suback_msg_id >= 0) {
    // Only accept if it matches current pending.
    if (_sub_pending_msg_id == _mb_suback_msg_id) {
      _sub_pending_msg_id = -1;
      _sub_cursor++;
    }
    _mb_suback_msg_id = -1;
  }

  return ((0 == _fsm_poll()) ? PollResult::NO_ACTION : PollResult::ACTION);
}


/**
* Called in idle time by the firmware to prod the driver's state machine forward.
*
* @return  1 on state shift
*          0 on no action
*         -1 on error
*/
FAST_FUNC int8_t MQTTClient::_fsm_poll() {
  int8_t ret = 0;
  bool fsm_advance = false;

  switch (currentState()) {
    case MQTTCliState::UNINIT:
      fsm_advance = _fsm_is_next_pos(MQTTCliState::INIT);
      break;

    case MQTTCliState::INIT:
      fsm_advance = initialized();
      break;

    // Exit conditions:
    //   - if network not ready: park
    //   - if mqtt event says connected: advance
    //   - if mqtt event says disconnected/error: park (and backoff applies at DISCONNECTED entry)
    case MQTTCliState::CONNECTING:
      if ((nullptr == _radio) || !_radio->linkUp() || !_radio->hasIP()) {
        fsm_advance = (0 == _fsm_prepend_state(MQTTCliState::DISCONNECTED));
      }
      else if (_mqtt_connected_latched) {
        fsm_advance = true;
      }
      else if (_mqtt_disconnected_latched) {
        fsm_advance = (0 == _fsm_prepend_state(MQTTCliState::DISCONNECTED));
      }
      break;

    case MQTTCliState::CONNECTED:
      if (_fsm_is_stable()) {
        // Network collapse -> stop client, then park.
        if ((nullptr == _radio) || !_radio->linkUp() || !_radio->hasIP()) {
          fsm_advance = (0 == _fsm_append_route(2, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED));
        }
        // MQTT collapse -> park.
        else if (!_mqtt_connected_latched || _mqtt_disconnected_latched) {
          fsm_advance = (0 == _fsm_append_state(MQTTCliState::DISCONNECTED));
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    case MQTTCliState::DISCONNECTING:
      fsm_advance = !_fsm_is_stable();
      break;

    // Greedy policy is applied here (while stable).
    case MQTTCliState::DISCONNECTED:
      if (_fsm_is_stable()) {
        const bool greedy = (autoconnect() && _current_broker.autoconnect() && _current_broker.isValid());
        const bool net_ok = ((nullptr != _radio) && _radio->linkUp() && _radio->hasIP());
        if (greedy && net_ok) {
          _fsm_append_route(2, MQTTCliState::CONNECTING, MQTTCliState::CONNECTED);
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    case MQTTCliState::FAULT:
      break;

    default:
      ret = -1;
      break;
  }

  if (fsm_advance & (-1 != ret)) {
    ret = (0 == _fsm_advance()) ? 1 : 0;
  }
  return ret;
}


/**
* Attempt a state entry.
*
* @return 0 on success, -1 otherwise.
*/
FAST_FUNC int8_t MQTTClient::_fsm_set_position(MQTTCliState new_state) {
  int8_t ret = -1;
  const MQTTCliState CURRENT_STATE = currentState();
  if (_fsm_is_waiting()) return ret;

  bool state_entry_success = false;

  switch (new_state) {
    case MQTTCliState::UNINIT:
      _set_fault("Tried to _fsm_set_position(UNINIT)");
      break;

    case MQTTCliState::INIT:
      if (!_flags.value(MQTT_FLAG_EVENT_LOOP_CREATED)) {
        switch (esp_event_loop_create_default()) {
          case ESP_OK:
          case ESP_ERR_INVALID_STATE:
            _flags.set(MQTT_FLAG_EVENT_LOOP_CREATED);
            break;
          default:
            _set_fault("Unable to create default event loop.");
            break;
        }
      }

      // If we're re-initting, tear down prior handle first.
      if (nullptr != _client_handle) {
        // Stop is safe here (not in event handler stack).
        esp_mqtt_client_stop(_client_handle);
        esp_mqtt_client_destroy(_client_handle);
        _flags.clear(MQTT_FLAG_ESP_MQTT_INIT);
        _client_handle = nullptr;
      }

      if (!_flags.value(MQTT_FLAG_ESP_MQTT_INIT) & _current_broker.isValid()) {
        // (Re)create client and register event handler.
        _client_handle = esp_mqtt_client_init(_current_broker.config());
        _flags.set(MQTT_FLAG_ESP_MQTT_INIT, (nullptr != _client_handle));
      }

      if (_flags.value(MQTT_FLAG_ESP_MQTT_INIT)) {
        switch (esp_mqtt_client_register_event(_client_handle, (esp_mqtt_event_id_t) ESP_EVENT_ANY_ID, mqtt_event_handler, this)) {
          case ESP_OK:
            _flags.set(MQTT_FLAG_EVENT_REGISTERED);
            break;
          default:
            _set_fault("Unable to esp_mqtt_client_register_event().");
            break;
        }
      }
      state_entry_success = initialized();
      break;

    case MQTTCliState::CONNECTING:
      if ((nullptr != _radio) && _radio->linkUp() && _radio->hasIP() && _current_broker.isValid() && initialized()) {
        _connect_attempt_active = true;
        _mqtt_disconnected_latched = false;  // Clear stale disconnect latch before attempt.
        state_entry_success = (ESP_OK == esp_mqtt_client_start(_client_handle));
      }
      break;

    case MQTTCliState::CONNECTED:
      // Success resets backoff.
      _connect_attempt_active = false;
      _reconnect_backoff_ms = 5000;
      _mqtt_disconnected_latched = false;
      state_entry_success = true;
      break;

    case MQTTCliState::DISCONNECTING:
      _connect_attempt_active = false;
      // NOTE: esp_mqtt_client_stop() must not be called from the event handler's stack frame.
      if (nullptr != _client_handle) {
        state_entry_success = (ESP_OK == esp_mqtt_client_stop(_client_handle));
      }
      else {
        state_entry_success = true;
      }
      break;

    case MQTTCliState::DISCONNECTED:
      state_entry_success = true;

      // Apply lockout ONLY if we were actively attempting a connection and ended up here.
      if (_connect_attempt_active) {
        _connect_attempt_active = false;

        const bool greedy = (autoconnect() && _current_broker.autoconnect() && _current_broker.isValid());
        if (greedy) {
          _fsm_lockout(_reconnect_backoff_ms);

          if (_reconnect_backoff_ms < _reconnect_backoff_ms_max) {
            uint32_t next = (_reconnect_backoff_ms << 1);
            _reconnect_backoff_ms = (next > _reconnect_backoff_ms_max) ? _reconnect_backoff_ms_max : next;
          }
        }
      }
      break;

    case MQTTCliState::FAULT:
      state_entry_success = true;
      _set_fault("Explicit FSM waypoint");
      break;

    default:
      _set_fault("Unhandled MQTTCliState");
      break;
  }

  if (state_entry_success) {
    if (_log_verbosity >= LOG_LEV_NOTICE) {
      c3p_log(LOG_LEV_NOTICE, "MQTTClient::_fsm_set_position",
        "MQTTClient State %s ---> %s",
        _FSM_STATES.enumStr(CURRENT_STATE), _FSM_STATES.enumStr(new_state)
      );
    }
    ret = 0;
  }

  return ret;
}


/**
* Put the driver into a FAULT state.
*/
void MQTTClient::_set_fault(const char* msg) {
  if (_log_verbosity >= LOG_LEV_WARN) c3p_log(LOG_LEV_WARN, "MQTTClient::_set_fault", "MQTTClient fault: %s", msg);
  _fsm_mark_current_state(MQTTCliState::FAULT);
}
